pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/WDT_A_356.0.xml
<module id="WDT_A" HW_revision="356.0">
    <register id="WDTCTL" width="16" offset="0x0" internal="0" description="Watchdog Timer Control Register">
        <bitfield id="WDTIS" description="Watchdog timer interval select" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="2G" value="0x0" description="Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz)"/>
            <bitenum id="128M" value="0x1" description="Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz)"/>
            <bitenum id="8192K" value="0x2" description="Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz)"/>
            <bitenum id="512K" value="0x3" description="Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz)"/>
            <bitenum id="32K" value="0x4" description="Watchdog clock source /(2^(15)) (1 s at 32.768 kHz)"/>
            <bitenum id="8192" value="0x5" description="Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz)"/>
            <bitenum id="512" value="0x6" description="Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz)"/>
            <bitenum id="64" value="0x7" description="Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz)"/>
        </bitfield>
        <bitfield id="WDTCNTCL" description="Watchdog timer counter clear" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="WDTCNTCL_0" value="0x0" description="No action"/>
            <bitenum id="WDTCNTCL_1" value="0x1" description="WDTCNT = 0000h"/>
        </bitfield>
        <bitfield id="WDTTMSEL" description="Watchdog timer mode select" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="WDTTMSEL_0" value="0x0" description="Watchdog mode"/>
            <bitenum id="WDTTMSEL_1" value="0x1" description="Interval timer mode"/>
        </bitfield>
        <bitfield id="WDTSSEL" description="Watchdog timer clock source select" begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="SMCLK" value="0x0" description="SMCLK"/>
            <bitenum id="ACLK" value="0x1" description="ACLK"/>
            <bitenum id="VLOCLK" value="0x2" description="VLOCLK"/>
            <bitenum id="BCLK" value="0x3" description="BCLK"/>
        </bitfield>
        <bitfield id="WDTHOLD" description="Watchdog timer hold" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UNHOLD" value="0x0" description="Watchdog timer is not stopped"/>
            <bitenum id="HOLD" value="0x1" description="Watchdog timer is stopped"/>
        </bitfield>
        <bitfield id="WDTPW" description="Watchdog timer password" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
</module>
